## 🤖 Terraform Plan Review Bot

**Environment:** dev
**AWS Region:** af-south-1
**Branch:** 6/merge
**Plan Status:** ✅ No changes

### 🔍 Security Scan Results

<details>
<summary><strong>Checkov:</strong> ❌ Failed</summary>

```


       _               _
   ___| |__   ___  ___| | _______   __
  / __| '_ \ / _ \/ __| |/ / _ \ \ / /
 | (__| | | |  __/ (__|   < (_) \ V /
  \___|_| |_|\___|\___|_|\_\___/ \_/

By Prisma Cloud | version: 3.2.494 
Update available 3.2.494 -> 3.2.495
Run pip3 install -U checkov to update 

terraform scan results:

Passed checks: 70, Failed checks: 22, Skipped checks: 0

Check: CKV_AWS_233: "Ensure Create before destroy for ACM certificates"
	PASSED for resource: aws_acm_certificate.main
	File: /acm.tf:2-15
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-aws-acm-certificate-enables-create-before-destroy
Check: CKV_AWS_234: "Verify logging preference for ACM certificates"
	PASSED for resource: aws_acm_certificate.main
	File: /acm.tf:2-15
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/ensure-aws-acm-certificates-has-logging-preference
Check: CKV_AWS_163: "Ensure ECR image scanning on push is enabled"
	PASSED for resource: aws_ecr_repository.game_service
	File: /ecr.tf:2-11
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/general-8
Check: CKV_AWS_163: "Ensure ECR image scanning on push is enabled"
	PASSED for resource: aws_ecr_repository.frontend_service
	File: /ecr.tf:13-23
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/general-8
Check: CKV_AWS_223: "Ensure ECS Cluster enables logging of ECS Exec"
	PASSED for resource: module.ecs.aws_ecs_cluster.main
	File: /modules/ecs/main.tf:2-14
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/ensure-aws-ecs-cluster-enables-logging-of-ecs-exec
Check: CKV_AWS_328: "Ensure that ALB is configured with defensive or strictest desync mitigation mode"
	PASSED for resource: module.ecs.aws_lb.main
	File: /modules/ecs/main.tf:17-31
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/bc-aws-328
Check: CKV_AWS_131: "Ensure that ALB drops HTTP headers"
	PASSED for resource: module.ecs.aws_lb.main
	File: /modules/ecs/main.tf:17-31
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-that-alb-drops-http-headers
Check: CKV_AWS_261: "Ensure HTTP HTTPS Target group defines Healthcheck"
	PASSED for resource: module.ecs.aws_lb_target_group.services
	File: /modules/ecs/main.tf:33-58
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/ensure-aws-kendra-index-server-side-encryption-uses-customer-managed-keys-cmks
Check: CKV_AWS_2: "Ensure ALB protocol is HTTPS"
	PASSED for resource: module.ecs.aws_lb_listener.http
	File: /modules/ecs/main.tf:60-73
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/networking-29
Check: CKV_AWS_2: "Ensure ALB protocol is HTTPS"
	PASSED for resource: module.ecs.aws_lb_listener.https
	File: /modules/ecs/main.tf:75-90
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/networking-29
Check: CKV_AWS_24: "Ensure no security groups allow ingress from 0.0.0.0:0 to port 22"
	PASSED for resource: module.ecs.aws_security_group.alb
	File: /modules/ecs/main.tf:111-142
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/networking-1-port-security
Check: CKV_AWS_25: "Ensure no security groups allow ingress from 0.0.0.0:0 to port 3389"
	PASSED for resource: module.ecs.aws_security_group.alb
	File: /modules/ecs/main.tf:111-142
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/networking-2
Check: CKV_AWS_277: "Ensure no security groups allow ingress from 0.0.0.0:0 to port -1"
	PASSED for resource: module.ecs.aws_security_group.alb
	File: /modules/ecs/main.tf:111-142
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-aws-security-group-does-not-allow-all-traffic-on-all-ports
Check: CKV_AWS_260: "Ensure no security groups allow ingress from 0.0.0.0:0 to port 80"
	PASSED for resource: module.ecs.aws_security_group.ecs_tasks
	File: /modules/ecs/main.tf:144-186
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-aws-security-groups-do-not-allow-ingress-from-00000-to-port-80
Check: CKV_AWS_24: "Ensure no security groups allow ingress from 0.0.0.0:0 to port 22"
	PASSED for resource: module.ecs.aws_security_group.ecs_tasks
	File: /modules/ecs/main.tf:144-186
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/networking-1-port-security
Check: CKV_AWS_25: "Ensure no security groups allow ingress from 0.0.0.0:0 to port 3389"
	PASSED for resource: module.ecs.aws_security_group.ecs_tasks
	File: /modules/ecs/main.tf:144-186
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/networking-2
Check: CKV_AWS_277: "Ensure no security groups allow ingress from 0.0.0.0:0 to port -1"
	PASSED for resource: module.ecs.aws_security_group.ecs_tasks
	File: /modules/ecs/main.tf:144-186
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-aws-security-group-does-not-allow-all-traffic-on-all-ports
Check: CKV_AWS_274: "Disallow IAM roles, users, and groups from using the AWS AdministratorAccess policy"
	PASSED for resource: module.ecs.aws_iam_role.ecs_task_execution_role
	File: /modules/ecs/main.tf:189-209
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-iam-policies/bc-aws-274
Check: CKV_AWS_61: "Ensure AWS IAM policy does not allow assume role permission across all services"
	PASSED for resource: module.ecs.aws_iam_role.ecs_task_execution_role
	File: /modules/ecs/main.tf:189-209
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-iam-policies/bc-aws-iam-45
Check: CKV_AWS_60: "Ensure IAM role allows only specific services or principals to assume it"
	PASSED for resource: module.ecs.aws_iam_role.ecs_task_execution_role
	File: /modules/ecs/main.tf:189-209
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-iam-policies/bc-aws-iam-44
Check: CKV_AWS_274: "Disallow IAM roles, users, and groups from using the AWS AdministratorAccess policy"
	PASSED for resource: module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy
	File: /modules/ecs/main.tf:211-214
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-iam-policies/bc-aws-274
Check: CKV_AWS_274: "Disallow IAM roles, users, and groups from using the AWS AdministratorAccess policy"
	PASSED for resource: module.ecs.aws_iam_role.ecs_task_role
	File: /modules/ecs/main.tf:216-236
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-iam-policies/bc-aws-274
Check: CKV_AWS_61: "Ensure AWS IAM policy does not allow assume role permission across all services"
	PASSED for resource: module.ecs.aws_iam_role.ecs_task_role
	File: /modules/ecs/main.tf:216-236
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-iam-policies/bc-aws-iam-45
Check: CKV_AWS_60: "Ensure IAM role allows only specific services or principals to assume it"
	PASSED for resource: module.ecs.aws_iam_role.ecs_task_role
	File: /modules/ecs/main.tf:216-236
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-iam-policies/bc-aws-iam-44
Check: CKV_AWS_158: "Ensure that CloudWatch Log Group is encrypted by KMS"
	PASSED for resource: module.ecs.aws_cloudwatch_log_group.services["frontend-service"]
	File: /modules/ecs/main.tf:239-250
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/ensure-that-cloudwatch-log-group-is-encrypted-by-kms
Check: CKV_AWS_66: "Ensure that CloudWatch Log Group specifies retention days"
	PASSED for resource: module.ecs.aws_cloudwatch_log_group.services["frontend-service"]
	File: /modules/ecs/main.tf:239-250
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-logging-policies/logging-13
Check: CKV_AWS_336: "Ensure ECS containers are limited to read-only access to root filesystems"
	PASSED for resource: module.ecs.aws_ecs_task_definition.services["frontend-service"]
	File: /modules/ecs/main.tf:253-309
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/bc-aws-336
Check: CKV_AWS_97: "Ensure Encryption in transit is enabled for EFS volumes in ECS Task definitions"
	PASSED for resource: module.ecs.aws_ecs_task_definition.services["frontend-service"]
	File: /modules/ecs/main.tf:253-309
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/bc-aws-general-39
Check: CKV_AWS_249: "Ensure that the Execution Role ARN and the Task Role ARN are different in ECS Task definitions"
	PASSED for resource: module.ecs.aws_ecs_task_definition.services["frontend-service"]
	File: /modules/ecs/main.tf:253-309
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-iam-policies/ensure-the-aws-execution-role-arn-and-task-role-arn-are-different-in-ecs-task-definitions
Check: CKV_AWS_333: "Ensure ECS services do not have public IP addresses assigned to them automatically"
	PASSED for resource: module.ecs.aws_ecs_service.services["frontend-service"]
	File: /modules/ecs/main.tf:346-382
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-logging-policies/bc-aws-333
Check: CKV_AWS_332: "Ensure ECS Fargate services run on the latest Fargate platform version"
	PASSED for resource: module.ecs.aws_ecs_service.services["frontend-service"]
	File: /modules/ecs/main.tf:346-382
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/bc-aws-332
Check: CKV_AWS_158: "Ensure that CloudWatch Log Group is encrypted by KMS"
	PASSED for resource: module.ecs.aws_cloudwatch_log_group.services["game-service"]
	File: /modules/ecs/main.tf:239-250
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/ensure-that-cloudwatch-log-group-is-encrypted-by-kms
Check: CKV_AWS_66: "Ensure that CloudWatch Log Group specifies retention days"
	PASSED for resource: module.ecs.aws_cloudwatch_log_group.services["game-service"]
	File: /modules/ecs/main.tf:239-250
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-logging-policies/logging-13
Check: CKV_AWS_336: "Ensure ECS containers are limited to read-only access to root filesystems"
	PASSED for resource: module.ecs.aws_ecs_task_definition.services["game-service"]
	File: /modules/ecs/main.tf:253-309
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/bc-aws-336
Check: CKV_AWS_97: "Ensure Encryption in transit is enabled for EFS volumes in ECS Task definitions"
	PASSED for resource: module.ecs.aws_ecs_task_definition.services["game-service"]
	File: /modules/ecs/main.tf:253-309
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/bc-aws-general-39
Check: CKV_AWS_249: "Ensure that the Execution Role ARN and the Task Role ARN are different in ECS Task definitions"
	PASSED for resource: module.ecs.aws_ecs_task_definition.services["game-service"]
	File: /modules/ecs/main.tf:253-309
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-iam-policies/ensure-the-aws-execution-role-arn-and-task-role-arn-are-different-in-ecs-task-definitions
Check: CKV_AWS_333: "Ensure ECS services do not have public IP addresses assigned to them automatically"
	PASSED for resource: module.ecs.aws_ecs_service.services["game-service"]
	File: /modules/ecs/main.tf:346-382
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-logging-policies/bc-aws-333
Check: CKV_AWS_332: "Ensure ECS Fargate services run on the latest Fargate platform version"
	PASSED for resource: module.ecs.aws_ecs_service.services["game-service"]
	File: /modules/ecs/main.tf:346-382
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/bc-aws-332
Check: CKV_AWS_158: "Ensure that CloudWatch Log Group is encrypted by KMS"
	PASSED for resource: module.ecs.aws_cloudwatch_log_group.grafana[0]
	File: /modules/ecs/monitoring.tf:7-18
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/ensure-that-cloudwatch-log-group-is-encrypted-by-kms
Check: CKV_AWS_66: "Ensure that CloudWatch Log Group specifies retention days"
	PASSED for resource: module.ecs.aws_cloudwatch_log_group.grafana[0]
	File: /modules/ecs/monitoring.tf:7-18
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-logging-policies/logging-13
Check: CKV_AWS_158: "Ensure that CloudWatch Log Group is encrypted by KMS"
	PASSED for resource: module.ecs.aws_cloudwatch_log_group.prometheus[0]
	File: /modules/ecs/monitoring.tf:21-32
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/ensure-that-cloudwatch-log-group-is-encrypted-by-kms
Check: CKV_AWS_66: "Ensure that CloudWatch Log Group specifies retention days"
	PASSED for resource: module.ecs.aws_cloudwatch_log_group.prometheus[0]
	File: /modules/ecs/monitoring.tf:21-32
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-logging-policies/logging-13
Check: CKV_AWS_336: "Ensure ECS containers are limited to read-only access to root filesystems"
	PASSED for resource: module.ecs.aws_ecs_task_definition.monitoring[0]
	File: /modules/ecs/monitoring.tf:35-124
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/bc-aws-336
Check: CKV_AWS_97: "Ensure Encryption in transit is enabled for EFS volumes in ECS Task definitions"
	PASSED for resource: module.ecs.aws_ecs_task_definition.monitoring[0]
	File: /modules/ecs/monitoring.tf:35-124
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/bc-aws-general-39
Check: CKV_AWS_249: "Ensure that the Execution Role ARN and the Task Role ARN are different in ECS Task definitions"
	PASSED for resource: module.ecs.aws_ecs_task_definition.monitoring[0]
	File: /modules/ecs/monitoring.tf:35-124
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-iam-policies/ensure-the-aws-execution-role-arn-and-task-role-arn-are-different-in-ecs-task-definitions
Check: CKV_AWS_261: "Ensure HTTP HTTPS Target group defines Healthcheck"
	PASSED for resource: module.ecs.aws_lb_target_group.grafana[0]
	File: /modules/ecs/monitoring.tf:127-152
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/ensure-aws-kendra-index-server-side-encryption-uses-customer-managed-keys-cmks
Check: CKV_AWS_333: "Ensure ECS services do not have public IP addresses assigned to them automatically"
	PASSED for resource: module.ecs.aws_ecs_service.monitoring[0]
	File: /modules/ecs/monitoring.tf:174-200
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-logging-policies/bc-aws-333
Check: CKV_AWS_332: "Ensure ECS Fargate services run on the latest Fargate platform version"
	PASSED for resource: module.ecs.aws_ecs_service.monitoring[0]
	File: /modules/ecs/monitoring.tf:174-200
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/bc-aws-332
Check: CKV_AWS_130: "Ensure VPC subnets do not assign public IP by default"
	PASSED for resource: module.network.aws_subnet.private[0]
	File: /modules/network/main.tf:44-56
	Calling File: /main.tf:2-7
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-vpc-subnets-do-not-assign-public-ip-by-default
Check: CKV_AWS_130: "Ensure VPC subnets do not assign public IP by default"
	PASSED for resource: module.network.aws_subnet.private[1]
	File: /modules/network/main.tf:44-56
	Calling File: /main.tf:2-7
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-vpc-subnets-do-not-assign-public-ip-by-default
Check: CKV_AWS_41: "Ensure no hard coded AWS access key and secret key exists in provider"
	PASSED for resource: aws.default
	File: /provider.tf:18-20
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/secrets-policies/bc-aws-secrets-5
Check: CKV2_AWS_19: "Ensure that all EIP addresses allocated to a VPC are attached to EC2 instances"
	PASSED for resource: module.network.aws_eip.nat[0]
	File: /modules/network/main.tf:59-69
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-that-all-eip-addresses-allocated-to-a-vpc-are-attached-to-ec2-instances
Check: CKV2_AWS_19: "Ensure that all EIP addresses allocated to a VPC are attached to EC2 instances"
	PASSED for resource: module.network.aws_eip.nat[1]
	File: /modules/network/main.tf:59-69
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-that-all-eip-addresses-allocated-to-a-vpc-are-attached-to-ec2-instances
Check: CKV2_AWS_56: "Ensure AWS Managed IAMFullAccess IAM policy is not used."
	PASSED for resource: module.ecs.aws_iam_role.ecs_task_execution_role
	File: /modules/ecs/main.tf:189-209
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-iam-policies/bc-aws-2-56
Check: CKV2_AWS_56: "Ensure AWS Managed IAMFullAccess IAM policy is not used."
	PASSED for resource: module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy
	File: /modules/ecs/main.tf:211-214
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-iam-policies/bc-aws-2-56
Check: CKV2_AWS_56: "Ensure AWS Managed IAMFullAccess IAM policy is not used."
	PASSED for resource: module.ecs.aws_iam_role.ecs_task_role
	File: /modules/ecs/main.tf:216-236
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-iam-policies/bc-aws-2-56
Check: CKV2_AWS_76: "Ensure AWS ALB attached WAFv2 WebACL is configured with AMR for Log4j Vulnerability"
	PASSED for resource: module.ecs.aws_lb.main
	File: /modules/ecs/main.tf:17-31
Check: CKV2_AWS_44: "Ensure AWS route table with VPC peering does not contain routes overly permissive to all traffic"
	PASSED for resource: module.network.aws_route_table.public
	File: /modules/network/main.tf:86-98
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-aws-route-table-with-vpc-peering-does-not-contain-routes-overly-permissive-to-all-traffic
Check: CKV2_AWS_44: "Ensure AWS route table with VPC peering does not contain routes overly permissive to all traffic"
	PASSED for resource: module.network.aws_route_table.private[0]
	File: /modules/network/main.tf:100-125
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-aws-route-table-with-vpc-peering-does-not-contain-routes-overly-permissive-to-all-traffic
Check: CKV2_AWS_44: "Ensure AWS route table with VPC peering does not contain routes overly permissive to all traffic"
	PASSED for resource: module.network.aws_route_table.private[1]
	File: /modules/network/main.tf:100-125
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-aws-route-table-with-vpc-peering-does-not-contain-routes-overly-permissive-to-all-traffic
Check: CKV2_AWS_5: "Ensure that Security Groups are attached to another resource"
	PASSED for resource: module.ecs.aws_security_group.alb
	File: /modules/ecs/main.tf:111-142
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-that-security-groups-are-attached-to-ec2-instances-or-elastic-network-interfaces-enis
Check: CKV2_AWS_5: "Ensure that Security Groups are attached to another resource"
	PASSED for resource: module.ecs.aws_security_group.ecs_tasks
	File: /modules/ecs/main.tf:144-186
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-that-security-groups-are-attached-to-ec2-instances-or-elastic-network-interfaces-enis
Check: CKV2_AWS_35: "AWS NAT Gateways should be utilized for the default route"
	PASSED for resource: module.network.aws_route_table.public
	File: /modules/network/main.tf:86-98
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-aws-nat-gateways-are-utilized-for-the-default-route
Check: CKV2_AWS_35: "AWS NAT Gateways should be utilized for the default route"
	PASSED for resource: module.network.aws_route_table.private[0]
	File: /modules/network/main.tf:100-125
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-aws-nat-gateways-are-utilized-for-the-default-route
Check: CKV2_AWS_35: "AWS NAT Gateways should be utilized for the default route"
	PASSED for resource: module.network.aws_route_table.private[1]
	File: /modules/network/main.tf:100-125
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-aws-nat-gateways-are-utilized-for-the-default-route
Check: CKV2_AWS_74: "Ensure AWS Load Balancers use strong ciphers"
	PASSED for resource: module.ecs.aws_lb_listener.http
	File: /modules/ecs/main.tf:60-73
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/bc-aws-2-74
Check: CKV2_AWS_74: "Ensure AWS Load Balancers use strong ciphers"
	PASSED for resource: module.ecs.aws_lb_listener.https
	File: /modules/ecs/main.tf:75-90
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/bc-aws-2-74
Check: CKV2_AWS_20: "Ensure that ALB redirects HTTP requests into HTTPS ones"
	PASSED for resource: module.ecs.aws_lb.main
	File: /modules/ecs/main.tf:17-31
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-that-alb-redirects-http-requests-into-https-ones
Check: CKV_AWS_103: "Ensure that load balancer is using at least TLS 1.2"
	PASSED for resource: module.ecs.aws_lb_listener.https
	File: /modules/ecs/main.tf:75-90
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/bc-aws-general-43
Check: CKV_AWS_103: "Ensure that load balancer is using at least TLS 1.2"
	PASSED for resource: module.ecs.aws_lb_listener.http
	File: /modules/ecs/main.tf:60-73
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/bc-aws-general-43
Check: CKV_AWS_136: "Ensure that ECR repositories are encrypted using KMS"
	FAILED for resource: aws_ecr_repository.game_service
	File: /ecr.tf:2-11
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/ensure-that-ecr-repositories-are-encrypted

		2  | resource "aws_ecr_repository" "game_service" {
		3  |   name                 = "${var.project_name}-game-service"
		4  |   image_tag_mutability = "MUTABLE"
		5  | 
		6  |   image_scanning_configuration {
		7  |     scan_on_push = true
		8  |   }
		9  | 
		10 |   tags = var.tags
		11 | }

Check: CKV_AWS_51: "Ensure ECR Image Tags are immutable"
	FAILED for resource: aws_ecr_repository.game_service
	File: /ecr.tf:2-11
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/bc-aws-general-24

		2  | resource "aws_ecr_repository" "game_service" {
		3  |   name                 = "${var.project_name}-game-service"
		4  |   image_tag_mutability = "MUTABLE"
		5  | 
		6  |   image_scanning_configuration {
		7  |     scan_on_push = true
		8  |   }
		9  | 
		10 |   tags = var.tags
		11 | }

Check: CKV_AWS_136: "Ensure that ECR repositories are encrypted using KMS"
	FAILED for resource: aws_ecr_repository.frontend_service
	File: /ecr.tf:13-23
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/ensure-that-ecr-repositories-are-encrypted

		13 | resource "aws_ecr_repository" "frontend_service" {
		14 |   name                 = "${var.project_name}-frontend-service"
		15 |   image_tag_mutability = "MUTABLE"
		16 | 
		17 |   image_scanning_configuration {
		18 |     scan_on_push = true
		19 |   }
		20 | 
		21 |   tags = var.tags
		22 |   
		23 | }

Check: CKV_AWS_51: "Ensure ECR Image Tags are immutable"
	FAILED for resource: aws_ecr_repository.frontend_service
	File: /ecr.tf:13-23
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/bc-aws-general-24

		13 | resource "aws_ecr_repository" "frontend_service" {
		14 |   name                 = "${var.project_name}-frontend-service"
		15 |   image_tag_mutability = "MUTABLE"
		16 | 
		17 |   image_scanning_configuration {
		18 |     scan_on_push = true
		19 |   }
		20 | 
		21 |   tags = var.tags
		22 |   
		23 | }

Check: CKV_AWS_65: "Ensure container insights are enabled on ECS cluster"
	FAILED for resource: module.ecs.aws_ecs_cluster.main
	File: /modules/ecs/main.tf:2-14
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-logging-policies/bc-aws-logging-11

		2  | resource "aws_ecs_cluster" "main" {
		3  |   name = "${var.environment}-${var.project_name}-cluster"
		4  | 
		5  |   setting {
		6  |     name  = "containerInsights"
		7  |     value = var.container_insights_enabled ? "enabled" : "disabled"
		8  |   }
		9  | 
		10 |   tags = merge(var.tags, {
		11 |     Name        = "${var.environment}-${var.project_name}-cluster"
		12 |     Environment = var.environment
		13 |   })
		14 | }

Check: CKV_AWS_91: "Ensure the ELBv2 (Application/Network) has access logging enabled"
	FAILED for resource: module.ecs.aws_lb.main
	File: /modules/ecs/main.tf:17-31
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-logging-policies/bc-aws-logging-22

		17 | resource "aws_lb" "main" {
		18 |   name               = "${var.environment}-${var.project_name}-alb"
		19 |   internal           = var.alb_internal
		20 |   load_balancer_type = "application"
		21 |   security_groups    = [aws_security_group.alb.id]
		22 |   subnets            = var.public_subnet_ids
		23 | 
		24 |   enable_deletion_protection = var.environment == "prod"
		25 |   drop_invalid_header_fields = true
		26 | 
		27 |   tags = merge(var.tags, {
		28 |     Name        = "${var.environment}-${var.project_name}-alb"
		29 |     Environment = var.environment
		30 |   })
		31 | }

Check: CKV_AWS_260: "Ensure no security groups allow ingress from 0.0.0.0:0 to port 80"
	FAILED for resource: module.ecs.aws_security_group.alb
	File: /modules/ecs/main.tf:111-142
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-aws-security-groups-do-not-allow-ingress-from-00000-to-port-80

		111 | resource "aws_security_group" "alb" {
		112 |   name_prefix = "${var.environment}-${var.project_name}-alb-"
		113 |   vpc_id      = var.vpc_id
		114 | 
		115 |   ingress {
		116 |     description = "HTTP"
		117 |     from_port   = 80
		118 |     to_port     = 80
		119 |     protocol    = "tcp"
		120 |     cidr_blocks = ["0.0.0.0/0"]
		121 |   }
		122 | 
		123 |   ingress {
		124 |     description = "HTTPS"
		125 |     from_port   = 443
		126 |     to_port     = 443
		127 |     protocol    = "tcp"
		128 |     cidr_blocks = ["0.0.0.0/0"]
		129 |   }
		130 | 
		131 |   egress {
		132 |     from_port   = 0
		133 |     to_port     = 0
		134 |     protocol    = "-1"
		135 |     cidr_blocks = ["0.0.0.0/0"]
		136 |   }
		137 | 
		138 |   tags = merge(var.tags, {
		139 |     Name        = "${var.environment}-${var.project_name}-alb-sg"
		140 |     Environment = var.environment
		141 |   })
		142 | }

Check: CKV_AWS_23: "Ensure every security group and rule has a description"
	FAILED for resource: module.ecs.aws_security_group.alb
	File: /modules/ecs/main.tf:111-142
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/networking-31

		111 | resource "aws_security_group" "alb" {
		112 |   name_prefix = "${var.environment}-${var.project_name}-alb-"
		113 |   vpc_id      = var.vpc_id
		114 | 
		115 |   ingress {
		116 |     description = "HTTP"
		117 |     from_port   = 80
		118 |     to_port     = 80
		119 |     protocol    = "tcp"
		120 |     cidr_blocks = ["0.0.0.0/0"]
		121 |   }
		122 | 
		123 |   ingress {
		124 |     description = "HTTPS"
		125 |     from_port   = 443
		126 |     to_port     = 443
		127 |     protocol    = "tcp"
		128 |     cidr_blocks = ["0.0.0.0/0"]
		129 |   }
		130 | 
		131 |   egress {
		132 |     from_port   = 0
		133 |     to_port     = 0
		134 |     protocol    = "-1"
		135 |     cidr_blocks = ["0.0.0.0/0"]
		136 |   }
		137 | 
		138 |   tags = merge(var.tags, {
		139 |     Name        = "${var.environment}-${var.project_name}-alb-sg"
		140 |     Environment = var.environment
		141 |   })
		142 | }

Check: CKV_AWS_382: "Ensure no security groups allow egress from 0.0.0.0:0 to port -1"
	FAILED for resource: module.ecs.aws_security_group.alb
	File: /modules/ecs/main.tf:111-142
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/bc-aws-382

		111 | resource "aws_security_group" "alb" {
		112 |   name_prefix = "${var.environment}-${var.project_name}-alb-"
		113 |   vpc_id      = var.vpc_id
		114 | 
		115 |   ingress {
		116 |     description = "HTTP"
		117 |     from_port   = 80
		118 |     to_port     = 80
		119 |     protocol    = "tcp"
		120 |     cidr_blocks = ["0.0.0.0/0"]
		121 |   }
		122 | 
		123 |   ingress {
		124 |     description = "HTTPS"
		125 |     from_port   = 443
		126 |     to_port     = 443
		127 |     protocol    = "tcp"
		128 |     cidr_blocks = ["0.0.0.0/0"]
		129 |   }
		130 | 
		131 |   egress {
		132 |     from_port   = 0
		133 |     to_port     = 0
		134 |     protocol    = "-1"
		135 |     cidr_blocks = ["0.0.0.0/0"]
		136 |   }
		137 | 
		138 |   tags = merge(var.tags, {
		139 |     Name        = "${var.environment}-${var.project_name}-alb-sg"
		140 |     Environment = var.environment
		141 |   })
		142 | }

Check: CKV_AWS_23: "Ensure every security group and rule has a description"
	FAILED for resource: module.ecs.aws_security_group.ecs_tasks
	File: /modules/ecs/main.tf:144-186
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/networking-31

		144 | resource "aws_security_group" "ecs_tasks" {
		145 |   name_prefix = "${var.environment}-${var.project_name}-ecs-tasks-"
		146 |   vpc_id      = var.vpc_id
		147 | 
		148 |   dynamic "ingress" {
		149 |     for_each = { for k, v in var.services : k => v if v.expose_alb }
		150 |     content {
		151 |       description     = "HTTP from ALB for ${ingress.key}"
		152 |       from_port       = ingress.value.port
		153 |       to_port         = ingress.value.port
		154 |       protocol        = "tcp"
		155 |       security_groups = [aws_security_group.alb.id]
		156 |     }
		157 |   }
		158 | 
		159 |   ingress {
		160 |     description     = "Grafana from ALB"
		161 |     from_port       = 3000
		162 |     to_port         = 3000
		163 |     protocol        = "tcp"
		164 |     security_groups = [aws_security_group.alb.id]
		165 |   }
		166 | 
		167 |   ingress {
		168 |     description = "Service to service"
		169 |     from_port   = 0
		170 |     to_port     = 65535
		171 |     protocol    = "tcp"
		172 |     self        = true
		173 |   }
		174 | 
		175 |   egress {
		176 |     from_port   = 0
		177 |     to_port     = 0
		178 |     protocol    = "-1"
		179 |     cidr_blocks = ["0.0.0.0/0"]
		180 |   }
		181 | 
		182 |   tags = merge(var.tags, {
		183 |     Name        = "${var.environment}-${var.project_name}-ecs-tasks-sg"
		184 |     Environment = var.environment
		185 |   })
		186 | }

Check: CKV_AWS_382: "Ensure no security groups allow egress from 0.0.0.0:0 to port -1"
	FAILED for resource: module.ecs.aws_security_group.ecs_tasks
	File: /modules/ecs/main.tf:144-186
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/bc-aws-382

		144 | resource "aws_security_group" "ecs_tasks" {
		145 |   name_prefix = "${var.environment}-${var.project_name}-ecs-tasks-"
		146 |   vpc_id      = var.vpc_id
		147 | 
		148 |   dynamic "ingress" {
		149 |     for_each = { for k, v in var.services : k => v if v.expose_alb }
		150 |     content {
		151 |       description     = "HTTP from ALB for ${ingress.key}"
		152 |       from_port       = ingress.value.port
		153 |       to_port         = ingress.value.port
		154 |       protocol        = "tcp"
		155 |       security_groups = [aws_security_group.alb.id]
		156 |     }
		157 |   }
		158 | 
		159 |   ingress {
		160 |     description     = "Grafana from ALB"
		161 |     from_port       = 3000
		162 |     to_port         = 3000
		163 |     protocol        = "tcp"
		164 |     security_groups = [aws_security_group.alb.id]
		165 |   }
		166 | 
		167 |   ingress {
		168 |     description = "Service to service"
		169 |     from_port   = 0
		170 |     to_port     = 65535
		171 |     protocol    = "tcp"
		172 |     self        = true
		173 |   }
		174 | 
		175 |   egress {
		176 |     from_port   = 0
		177 |     to_port     = 0
		178 |     protocol    = "-1"
		179 |     cidr_blocks = ["0.0.0.0/0"]
		180 |   }
		181 | 
		182 |   tags = merge(var.tags, {
		183 |     Name        = "${var.environment}-${var.project_name}-ecs-tasks-sg"
		184 |     Environment = var.environment
		185 |   })
		186 | }

Check: CKV_AWS_338: "Ensure CloudWatch log groups retains logs for at least 1 year"
	FAILED for resource: module.ecs.aws_cloudwatch_log_group.services["frontend-service"]
	File: /modules/ecs/main.tf:239-250
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-logging-policies/bc-aws-338

		239 | resource "aws_cloudwatch_log_group" "services" {
		240 |   for_each = var.services
		241 | 
		242 |   name              = "/ecs/${var.environment}-${var.project_name}-${each.key}"
		243 |   retention_in_days = var.log_retention_days
		244 |   kms_key_id        = var.kms_key_id
		245 | 
		246 |   tags = merge(var.tags, {
		247 |     Name        = "${var.environment}-${var.project_name}-${each.key}-logs"
		248 |     Environment = var.environment
		249 |   })
		250 | }

Check: CKV_AWS_338: "Ensure CloudWatch log groups retains logs for at least 1 year"
	FAILED for resource: module.ecs.aws_cloudwatch_log_group.services["game-service"]
	File: /modules/ecs/main.tf:239-250
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-logging-policies/bc-aws-338

		239 | resource "aws_cloudwatch_log_group" "services" {
		240 |   for_each = var.services
		241 | 
		242 |   name              = "/ecs/${var.environment}-${var.project_name}-${each.key}"
		243 |   retention_in_days = var.log_retention_days
		244 |   kms_key_id        = var.kms_key_id
		245 | 
		246 |   tags = merge(var.tags, {
		247 |     Name        = "${var.environment}-${var.project_name}-${each.key}-logs"
		248 |     Environment = var.environment
		249 |   })
		250 | }

Check: CKV_AWS_338: "Ensure CloudWatch log groups retains logs for at least 1 year"
	FAILED for resource: module.ecs.aws_cloudwatch_log_group.grafana[0]
	File: /modules/ecs/monitoring.tf:7-18
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-logging-policies/bc-aws-338

		7  | resource "aws_cloudwatch_log_group" "grafana" {
		8  |   count = local.monitoring_enabled ? 1 : 0
		9  | 
		10 |   name              = "/ecs/${var.environment}-${var.project_name}-grafana"
		11 |   retention_in_days = var.log_retention_days
		12 |   kms_key_id        = var.kms_key_id
		13 | 
		14 |   tags = merge(var.tags, {
		15 |     Name        = "${var.environment}-${var.project_name}-grafana-logs"
		16 |     Environment = var.environment
		17 |   })
		18 | }

Check: CKV_AWS_338: "Ensure CloudWatch log groups retains logs for at least 1 year"
	FAILED for resource: module.ecs.aws_cloudwatch_log_group.prometheus[0]
	File: /modules/ecs/monitoring.tf:21-32
	Calling File: /main.tf:10-56
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-logging-policies/bc-aws-338

		21 | resource "aws_cloudwatch_log_group" "prometheus" {
		22 |   count = local.monitoring_enabled ? 1 : 0
		23 | 
		24 |   name              = "/ecs/${var.environment}-${var.project_name}-prometheus"
		25 |   retention_in_days = var.log_retention_days
		26 |   kms_key_id        = var.kms_key_id
		27 | 
		28 |   tags = merge(var.tags, {
		29 |     Name        = "${var.environment}-${var.project_name}-prometheus-logs"
		30 |     Environment = var.environment
		31 |   })
		32 | }

Check: CKV_AWS_130: "Ensure VPC subnets do not assign public IP by default"
	FAILED for resource: module.network.aws_subnet.public[0]
	File: /modules/network/main.tf:28-41
	Calling File: /main.tf:2-7
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-vpc-subnets-do-not-assign-public-ip-by-default

		28 | resource "aws_subnet" "public" {
		29 |   count = 2
		30 | 
		31 |   vpc_id                  = aws_vpc.main.id
		32 |   cidr_block              = cidrsubnet(var.vpc_cidr, 8, count.index)
		33 |   availability_zone       = data.aws_availability_zones.available.names[count.index]
		34 |   map_public_ip_on_launch = true
		35 | 
		36 |   tags = {
		37 |     Name        = "${var.environment}-${var.project_name}-public-${count.index + 1}"
		38 |     Environment = var.environment
		39 |     Type        = "Public"
		40 |   }
		41 | }

Check: CKV_AWS_130: "Ensure VPC subnets do not assign public IP by default"
	FAILED for resource: module.network.aws_subnet.public[1]
	File: /modules/network/main.tf:28-41
	Calling File: /main.tf:2-7
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-vpc-subnets-do-not-assign-public-ip-by-default

		28 | resource "aws_subnet" "public" {
		29 |   count = 2
		30 | 
		31 |   vpc_id                  = aws_vpc.main.id
		32 |   cidr_block              = cidrsubnet(var.vpc_cidr, 8, count.index)
		33 |   availability_zone       = data.aws_availability_zones.available.names[count.index]
		34 |   map_public_ip_on_launch = true
		35 | 
		36 |   tags = {
		37 |     Name        = "${var.environment}-${var.project_name}-public-${count.index + 1}"
		38 |     Environment = var.environment
		39 |     Type        = "Public"
		40 |   }
		41 | }

Check: CKV_AWS_378: "Ensure AWS Load Balancer doesn't use HTTP protocol"
	FAILED for resource: module.ecs.aws_lb_target_group.services
	File: /modules/ecs/main.tf:33-58
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/bc-aws-378

		33 | resource "aws_lb_target_group" "services" {
		34 |   for_each = { for k, v in var.services : k => v if v.expose_alb }
		35 | 
		36 |   name     = "${var.environment}-${substr(each.key, 0, 20)}-tg"
		37 |   port     = each.value.port
		38 |   protocol = "HTTP"
		39 |   vpc_id   = var.vpc_id
		40 |   target_type = "ip"
		41 | 
		42 |   health_check {
		43 |     enabled             = true
		44 |     healthy_threshold   = var.health_check_healthy_threshold
		45 |     interval            = var.health_check_interval
		46 |     matcher             = "200"
		47 |     path                = var.health_check_path
		48 |     port                = "traffic-port"
		49 |     protocol            = "HTTP"
		50 |     timeout             = var.health_check_timeout
		51 |     unhealthy_threshold = var.health_check_unhealthy_threshold
		52 |   }
		53 | 
		54 |   tags = merge(var.tags, {
		55 |     Name        = "${var.environment}-${var.project_name}-${each.key}-tg"
		56 |     Environment = var.environment
		57 |   })
		58 | }

Check: CKV_AWS_378: "Ensure AWS Load Balancer doesn't use HTTP protocol"
	FAILED for resource: module.ecs.aws_lb_target_group.grafana[0]
	File: /modules/ecs/monitoring.tf:127-152
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/bc-aws-378

		127 | resource "aws_lb_target_group" "grafana" {
		128 |   count = local.monitoring_enabled ? 1 : 0
		129 | 
		130 |   name     = "${var.environment}-grafana-tg"
		131 |   port     = 3000
		132 |   protocol = "HTTP"
		133 |   vpc_id   = var.vpc_id
		134 |   target_type = "ip"
		135 | 
		136 |   health_check {
		137 |     enabled             = true
		138 |     healthy_threshold   = var.health_check_healthy_threshold
		139 |     interval            = var.health_check_interval
		140 |     matcher             = "200"
		141 |     path                = "/api/health"
		142 |     port                = "traffic-port"
		143 |     protocol            = "HTTP"
		144 |     timeout             = var.health_check_timeout
		145 |     unhealthy_threshold = var.health_check_unhealthy_threshold
		146 |   }
		147 | 
		148 |   tags = merge(var.tags, {
		149 |     Name        = "${var.environment}-${var.project_name}-grafana-tg"
		150 |     Environment = var.environment
		151 |   })
		152 | }

Check: CKV2_AWS_28: "Ensure public facing ALB are protected by WAF"
	FAILED for resource: module.ecs.aws_lb.main
	File: /modules/ecs/main.tf:17-31
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-public-facing-alb-are-protected-by-waf

		17 | resource "aws_lb" "main" {
		18 |   name               = "${var.environment}-${var.project_name}-alb"
		19 |   internal           = var.alb_internal
		20 |   load_balancer_type = "application"
		21 |   security_groups    = [aws_security_group.alb.id]
		22 |   subnets            = var.public_subnet_ids
		23 | 
		24 |   enable_deletion_protection = var.environment == "prod"
		25 |   drop_invalid_header_fields = true
		26 | 
		27 |   tags = merge(var.tags, {
		28 |     Name        = "${var.environment}-${var.project_name}-alb"
		29 |     Environment = var.environment
		30 |   })
		31 | }

Check: CKV2_AWS_12: "Ensure the default security group of every VPC restricts all traffic"
	FAILED for resource: module.network.aws_vpc.main
	File: /modules/network/main.tf:6-15
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/networking-4

		6  | resource "aws_vpc" "main" {
		7  |   cidr_block           = var.vpc_cidr
		8  |   enable_dns_hostnames = true
		9  |   enable_dns_support   = true
		10 | 
		11 |   tags = merge(var.tags, {
		12 |     Name        = "${var.environment}-${var.project_name}-vpc"
		13 |     Environment = var.environment
		14 |   })
		15 | }

Check: CKV2_AWS_11: "Ensure VPC flow logging is enabled in all VPCs"
	FAILED for resource: module.network.aws_vpc.main
	File: /modules/network/main.tf:6-15
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-logging-policies/logging-9-enable-vpc-flow-logging

		6  | resource "aws_vpc" "main" {
		7  |   cidr_block           = var.vpc_cidr
		8  |   enable_dns_hostnames = true
		9  |   enable_dns_support   = true
		10 | 
		11 |   tags = merge(var.tags, {
		12 |     Name        = "${var.environment}-${var.project_name}-vpc"
		13 |     Environment = var.environment
		14 |   })
		15 | }



Wrote output in SARIF format to the file 'results.sarif'
```
</details>

<details>
<summary><strong>TFLint:</strong> ❌ Failed</summary>

```
TFLint scan completed - check workflow logs for detailed results
```
</details>

<details>
<summary><strong>TFSec:</strong> ❌ Failed</summary>

```
TFSec scan completed - check workflow logs for detailed results
```
</details>

### 📋 Terraform Plan Output
<details>
<summary>Click to view plan details</summary>

```terraform
[command]/home/runner/work/_temp/00ed745e-9e82-4baa-a045-16d92e6c1297/terraform-bin plan -var-file=./terraform.tfvars -no-color -detailed-exitcode
data.cloudflare_zone.this: Reading...
module.network.data.aws_availability_zones.available: Reading...
data.aws_caller_identity.current: Reading...
aws_ecr_repository.frontend_service: Refreshing state... [id=portfolio-frontend-service]
aws_ecr_repository.game_service: Refreshing state... [id=portfolio-game-service]
module.network.aws_vpc.main: Refreshing state... [id=vpc-06dc689a998868942]
data.aws_caller_identity.current: Read complete after 0s [id=718307299417]
module.network.data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]
null_resource.build_and_push_images: Refreshing state... [id=3849459137950386280]
module.ecs.aws_cloudwatch_log_group.services["game-service"]: Refreshing state... [id=/ecs/dev-portfolio-game-service]
module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:eu-west-1:718307299417:cluster/dev-portfolio-cluster]
module.ecs.aws_cloudwatch_log_group.services["frontend-service"]: Refreshing state... [id=/ecs/dev-portfolio-frontend-service]
module.ecs.aws_iam_role.ecs_task_role: Refreshing state... [id=dev-portfolio-ecs-task-role]
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=dev-portfolio-ecs-task-execution-role]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=dev-portfolio-ecs-task-execution-role-20251217190420950600000006]
data.cloudflare_zone.this: Read complete after 2s [id=706bde896e93c6118ccea3f36ee729a1]
module.ecs.aws_cloudwatch_log_group.grafana[0]: Refreshing state... [id=/ecs/dev-portfolio-grafana]
aws_acm_certificate.main: Refreshing state... [id=arn:aws:acm:eu-west-1:718307299417:certificate/04834e6d-daa5-4bec-a331-6481049463cd]
module.ecs.aws_cloudwatch_log_group.prometheus[0]: Refreshing state... [id=/ecs/dev-portfolio-prometheus]
module.ecs.aws_ecs_task_definition.services["game-service"]: Refreshing state... [id=dev-portfolio-game-service]
module.ecs.aws_ecs_task_definition.services["frontend-service"]: Refreshing state... [id=dev-portfolio-frontend-service]
module.ecs.aws_ecs_task_definition.monitoring[0]: Refreshing state... [id=dev-portfolio-monitoring]
module.network.aws_subnet.public[0]: Refreshing state... [id=subnet-00e21107697632557]
module.network.aws_subnet.public[1]: Refreshing state... [id=subnet-090cd45307083e6b4]
module.ecs.aws_service_discovery_private_dns_namespace.main: Refreshing state... [id=ns-epv7a63hbpctxzbu]
module.network.aws_internet_gateway.main: Refreshing state... [id=igw-009fdc69ee5e254aa]
module.network.aws_subnet.private[1]: Refreshing state... [id=subnet-02b31511d5101d307]
module.network.aws_subnet.private[0]: Refreshing state... [id=subnet-012dd34745269e690]
module.ecs.aws_lb_target_group.services["frontend-service"]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:718307299417:targetgroup/dev-frontend-service-tg/cff06267c5b86a36]
module.ecs.aws_security_group.alb: Refreshing state... [id=sg-041ce68b806f87cfd]
module.ecs.aws_lb_target_group.grafana[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:718307299417:targetgroup/dev-grafana-tg/50f1b62eb45fa9e3]
aws_acm_certificate_validation.main: Refreshing state... [id=2025-12-17 19:03:56.354 +0000 UTC]
module.network.aws_route_table.public: Refreshing state... [id=rtb-05297ebcaa4fe1a59]
module.network.aws_eip.nat[0]: Refreshing state... [id=eipalloc-07a4211b492ca5182]
module.network.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0d5dd7263291e04fa]
module.ecs.aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:718307299417:loadbalancer/app/dev-portfolio-alb/f9ec1e5fa76b4d12]
module.ecs.aws_security_group.ecs_tasks: Refreshing state... [id=sg-0288cfdeadc8da900]
module.ecs.aws_service_discovery_service.services["game-service"]: Refreshing state... [id=srv-ik52khg2qoj74ule]
module.network.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0416c07e17d99d7f7]
module.network.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-040af5535328e23eb]
module.network.aws_nat_gateway.main[1]: Refreshing state... [id=nat-041d3db0997512e48]
module.network.aws_nat_gateway.main[0]: Refreshing state... [id=nat-03014ab0a0e7c91a5]
module.network.aws_route_table.private[1]: Refreshing state... [id=rtb-0d50e6335906a528d]
module.network.aws_route_table.private[0]: Refreshing state... [id=rtb-0c1eee065e6fc6891]
module.network.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0b8dd9fda87554bb2]
module.network.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-054f1d9e94dd862d7]
module.ecs.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:718307299417:listener/app/dev-portfolio-alb/f9ec1e5fa76b4d12/9d91334163899f0a]
cloudflare_record.monitoring: Refreshing state... [id=3d04dd0af586b7d35cfd4a909ed3dfb3]
cloudflare_record.portfolio_app: Refreshing state... [id=8671cda015076ed5b758ef7f6fabca35]
module.ecs.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:718307299417:listener/app/dev-portfolio-alb/f9ec1e5fa76b4d12/0cdf9c3a38d954ae]
module.ecs.aws_lb_listener_rule.grafana[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:718307299417:listener-rule/app/dev-portfolio-alb/f9ec1e5fa76b4d12/9d91334163899f0a/d0d6c9757658dc6a]
module.ecs.aws_lb_listener_rule.services["frontend-service"]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:718307299417:listener-rule/app/dev-portfolio-alb/f9ec1e5fa76b4d12/9d91334163899f0a/9ebf62bd085f2521]
module.ecs.aws_ecs_service.monitoring[0]: Refreshing state... [id=arn:aws:ecs:eu-west-1:718307299417:service/dev-portfolio-cluster/dev-portfolio-monitoring]
module.ecs.aws_ecs_service.services["game-service"]: Refreshing state... [id=arn:aws:ecs:eu-west-1:718307299417:service/dev-portfolio-cluster/dev-portfolio-game-service]
module.ecs.aws_ecs_service.services["frontend-service"]: Refreshing state... [id=arn:aws:ecs:eu-west-1:718307299417:service/dev-portfolio-cluster/dev-portfolio-frontend-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # null_resource.build_and_push_images must be replaced
-/+ resource "null_resource" "build_and_push_images" {
      ~ id       = "3849459137950386280" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2025-12-17T20:27:59Z" -> (known after apply)
        }
    }

  # module.ecs.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.ecs.aws_ecs_service.monitoring[0] will be updated in-place
  ~ resource "aws_ecs_service" "monitoring" {
        id                                 = "arn:aws:ecs:eu-west-1:718307299417:service/dev-portfolio-cluster/dev-portfolio-monitoring"
        name                               = "dev-portfolio-monitoring"
        tags                               = {
            "Environment" = "dev"
            "Name"        = "dev-portfolio-monitoring"
        }
      ~ task_definition                    = "arn:aws:ecs:eu-west-1:718307299417:task-definition/dev-portfolio-monitoring:7" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_service.services["frontend-service"] will be updated in-place
  ~ resource "aws_ecs_service" "services" {
        id                                 = "arn:aws:ecs:eu-west-1:718307299417:service/dev-portfolio-cluster/dev-portfolio-frontend-service"
        name                               = "dev-portfolio-frontend-service"
        tags                               = {
            "Environment" = "dev"
            "Name"        = "dev-portfolio-frontend-service"
        }
      ~ task_definition                    = "arn:aws:ecs:eu-west-1:718307299417:task-definition/dev-portfolio-frontend-service:7" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_service.services["game-service"] will be updated in-place
  ~ resource "aws_ecs_service" "services" {
        id                                 = "arn:aws:ecs:eu-west-1:718307299417:service/dev-portfolio-cluster/dev-portfolio-game-service"
        name                               = "dev-portfolio-game-service"
        tags                               = {
            "Environment" = "dev"
            "Name"        = "dev-portfolio-game-service"
        }
      ~ task_definition                    = "arn:aws:ecs:eu-west-1:718307299417:task-definition/dev-portfolio-game-service:7" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.monitoring[0] must be replaced
-/+ resource "aws_ecs_task_definition" "monitoring" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:718307299417:task-definition/dev-portfolio-monitoring:7" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:718307299417:task-definition/dev-portfolio-monitoring" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "GF_DATASOURCES_DEFAULT_URL"
                          - value = "http://localhost:9090"
                        },
                      - {
                          - name  = "GF_SECURITY_ADMIN_PASSWORD"
                          - value = "admin123"
                        },
                      - {
                          - name  = "GF_USERS_ALLOW_SIGN_UP"
                          - value = "false"
                        },
                    ]
                  - essential        = true
                  - healthCheck      = {
                      - command     = [
                          - "CMD-SHELL",
                          - "wget --quiet --tries=1 --spider http://localhost:3000/api/health || exit 1",
                        ]
                      - interval    = 30
                      - retries     = 3
                      - startPeriod = 60
                      - timeout     = 5
                    }
                  - image            = "grafana/grafana:10.0.0"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/dev-portfolio-grafana"
                          - awslogs-region        = "eu-west-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - mountPoints      = []
                  - name             = "grafana"
                  - portMappings     = [
                      - {
                          - containerPort = 3000
                          - hostPort      = 3000
                          - protocol      = "tcp"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
              - {
                  - cpu              = 0
                  - environment      = []
                  - essential        = true
                  - healthCheck      = {
                      - command     = [
                          - "CMD-SHELL",
                          - "wget --quiet --tries=1 --spider http://localhost:9090/-/healthy || exit 1",
                        ]
                      - interval    = 30
                      - retries     = 3
                      - startPeriod = 60
                      - timeout     = 5
                    }
                  - image            = "prom/prometheus:v2.40.0"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/dev-portfolio-prometheus"
                          - awslogs-region        = "eu-west-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - mountPoints      = []
                  - name             = "prometheus"
                  - portMappings     = [
                      - {
                          - containerPort = 9090
                          - hostPort      = 9090
                          - protocol      = "tcp"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "dev-portfolio-monitoring" -> (known after apply)
      ~ revision                 = 7 -> (known after apply)
        tags                     = {
            "Environment" = "dev"
            "Name"        = "dev-portfolio-monitoring-task"
        }
        # (11 unchanged attributes hidden)
    }

  # module.ecs.aws_ecs_task_definition.services["frontend-service"] must be replaced
-/+ resource "aws_ecs_task_definition" "services" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:718307299417:task-definition/dev-portfolio-frontend-service:7" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:718307299417:task-definition/dev-portfolio-frontend-service" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "GAME_SERVICE_URL"
                          - value = "http://game-service.dev-portfolio.local:8081"
                        },
                      - {
                          - name  = "LOG_LEVEL"
                          - value = "info"
                        },
                      - {
                          - name  = "PORT"
                          - value = "8080"
                        },
                    ]
                  - essential        = true
                  - healthCheck      = {
                      - command     = [
                          - "CMD-SHELL",
                          - "wget --quiet --tries=1 --spider http://localhost:8080/health || exit 1",
                        ]
                      - interval    = 30
                      - retries     = 3
                      - startPeriod = 60
                      - timeout     = 5
                    }
                  - image            = "718307299417.dkr.ecr.eu-west-1.amazonaws.com/portfolio-frontend-service:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/dev-portfolio-frontend-service"
                          - awslogs-region        = "eu-west-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - mountPoints      = []
                  - name             = "frontend-service"
                  - portMappings     = [
                      - {
                          - containerPort = 8080
                          - hostPort      = 8080
                          - protocol      = "tcp"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "dev-portfolio-frontend-service" -> (known after apply)
      ~ revision                 = 7 -> (known after apply)
        tags                     = {
            "Environment" = "dev"
            "Name"        = "dev-portfolio-frontend-service-task"
        }
        # (11 unchanged attributes hidden)
    }

  # module.ecs.aws_ecs_task_definition.services["game-service"] must be replaced
-/+ resource "aws_ecs_task_definition" "services" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:718307299417:task-definition/dev-portfolio-game-service:7" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:718307299417:task-definition/dev-portfolio-game-service" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "LOG_LEVEL"
                          - value = "info"
                        },
                      - {
                          - name  = "PORT"
                          - value = "8081"
                        },
                    ]
                  - essential        = true
                  - healthCheck      = {
                      - command     = [
                          - "CMD-SHELL",
                          - "wget --quiet --tries=1 --spider http://localhost:8081/health || exit 1",
                        ]
                      - interval    = 30
                      - retries     = 3
                      - startPeriod = 60
                      - timeout     = 5
                    }
                  - image            = "718307299417.dkr.ecr.eu-west-1.amazonaws.com/portfolio-game-service:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/dev-portfolio-game-service"
                          - awslogs-region        = "eu-west-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - mountPoints      = []
                  - name             = "game-service"
                  - portMappings     = [
                      - {
                          - containerPort = 8081
                          - hostPort      = 8081
                          - protocol      = "tcp"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "dev-portfolio-game-service" -> (known after apply)
      ~ revision                 = 7 -> (known after apply)
        tags                     = {
            "Environment" = "dev"
            "Name"        = "dev-portfolio-game-service-task"
        }
        # (11 unchanged attributes hidden)
    }

Plan: 4 to add, 3 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 2.
::debug::stdout: data.cloudflare_zone.this: Reading...%0Amodule.network.data.aws_availability_zones.available: Reading...%0Adata.aws_caller_identity.current: Reading...%0Aaws_ecr_repository.frontend_service: Refreshing state... [id=portfolio-frontend-service]%0Aaws_ecr_repository.game_service: Refreshing state... [id=portfolio-game-service]%0Amodule.network.aws_vpc.main: Refreshing state... [id=vpc-06dc689a998868942]%0Adata.aws_caller_identity.current: Read complete after 0s [id=718307299417]%0Amodule.network.data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]%0Anull_resource.build_and_push_images: Refreshing state... [id=3849459137950386280]%0Amodule.ecs.aws_cloudwatch_log_group.services["game-service"]: Refreshing state... [id=/ecs/dev-portfolio-game-service]%0Amodule.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:eu-west-1:718307299417:cluster/dev-portfolio-cluster]%0Amodule.ecs.aws_cloudwatch_log_group.services["frontend-service"]: Refreshing state... [id=/ecs/dev-portfolio-frontend-service]%0Amodule.ecs.aws_iam_role.ecs_task_role: Refreshing state... [id=dev-portfolio-ecs-task-role]%0Amodule.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=dev-portfolio-ecs-task-execution-role]%0Amodule.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=dev-portfolio-ecs-task-execution-role-20251217190420950600000006]%0Adata.cloudflare_zone.this: Read complete after 2s [id=706bde896e93c6118ccea3f36ee729a1]%0Amodule.ecs.aws_cloudwatch_log_group.grafana[0]: Refreshing state... [id=/ecs/dev-portfolio-grafana]%0Aaws_acm_certificate.main: Refreshing state... [id=arn:aws:acm:eu-west-1:718307299417:certificate/04834e6d-daa5-4bec-a331-6481049463cd]%0Amodule.ecs.aws_cloudwatch_log_group.prometheus[0]: Refreshing state... [id=/ecs/dev-portfolio-prometheus]%0Amodule.ecs.aws_ecs_task_definition.services["game-service"]: Refreshing state... [id=dev-portfolio-game-service]%0Amodule.ecs.aws_ecs_task_definition.services["frontend-service"]: Refreshing state... [id=dev-portfolio-frontend-service]%0Amodule.ecs.aws_ecs_task_definition.monitoring[0]: Refreshing state... [id=dev-portfolio-monitoring]%0Amodule.network.aws_subnet.public[0]: Refreshing state... [id=subnet-00e21107697632557]%0Amodule.network.aws_subnet.public[1]: Refreshing state... [id=subnet-090cd45307083e6b4]%0Amodule.ecs.aws_service_discovery_private_dns_namespace.main: Refreshing state... [id=ns-epv7a63hbpctxzbu]%0Amodule.network.aws_internet_gateway.main: Refreshing state... [id=igw-009fdc69ee5e254aa]%0Amodule.network.aws_subnet.private[1]: Refreshing state... [id=subnet-02b31511d5101d307]%0Amodule.network.aws_subnet.private[0]: Refreshing state... [id=subnet-012dd34745269e690]%0Amodule.ecs.aws_lb_target_group.services["frontend-service"]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:718307299417:targetgroup/dev-frontend-service-tg/cff06267c5b86a36]%0Amodule.ecs.aws_security_group.alb: Refreshing state... [id=sg-041ce68b806f87cfd]%0Amodule.ecs.aws_lb_target_group.grafana[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:718307299417:targetgroup/dev-grafana-tg/50f1b62eb45fa9e3]%0Aaws_acm_certificate_validation.main: Refreshing state... [id=2025-12-17 19:03:56.354 +0000 UTC]%0Amodule.network.aws_route_table.public: Refreshing state... [id=rtb-05297ebcaa4fe1a59]%0Amodule.network.aws_eip.nat[0]: Refreshing state... [id=eipalloc-07a4211b492ca5182]%0Amodule.network.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0d5dd7263291e04fa]%0Amodule.ecs.aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:718307299417:loadbalancer/app/dev-portfolio-alb/f9ec1e5fa76b4d12]%0Amodule.ecs.aws_security_group.ecs_tasks: Refreshing state... [id=sg-0288cfdeadc8da900]%0Amodule.ecs.aws_service_discovery_service.services["game-service"]: Refreshing state... [id=srv-ik52khg2qoj74ule]%0Amodule.network.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0416c07e17d99d7f7]%0Amodule.network.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-040af5535328e23eb]%0Amodule.network.aws_nat_gateway.main[1]: Refreshing state... [id=nat-041d3db0997512e48]%0Amodule.network.aws_nat_gateway.main[0]: Refreshing state... [id=nat-03014ab0a0e7c91a5]%0Amodule.network.aws_route_table.private[1]: Refreshing state... [id=rtb-0d50e6335906a528d]%0Amodule.network.aws_route_table.private[0]: Refreshing state... [id=rtb-0c1eee065e6fc6891]%0Amodule.network.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0b8dd9fda87554bb2]%0Amodule.network.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-054f1d9e94dd862d7]%0Amodule.ecs.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:718307299417:listener/app/dev-portfolio-alb/f9ec1e5fa76b4d12/9d91334163899f0a]%0Acloudflare_record.monitoring: Refreshing state... [id=3d04dd0af586b7d35cfd4a909ed3dfb3]%0Acloudflare_record.portfolio_app: Refreshing state... [id=8671cda015076ed5b758ef7f6fabca35]%0Amodule.ecs.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:718307299417:listener/app/dev-portfolio-alb/f9ec1e5fa76b4d12/0cdf9c3a38d954ae]%0Amodule.ecs.aws_lb_listener_rule.grafana[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:718307299417:listener-rule/app/dev-portfolio-alb/f9ec1e5fa76b4d12/9d91334163899f0a/d0d6c9757658dc6a]%0Amodule.ecs.aws_lb_listener_rule.services["frontend-service"]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:718307299417:listener-rule/app/dev-portfolio-alb/f9ec1e5fa76b4d12/9d91334163899f0a/9ebf62bd085f2521]%0Amodule.ecs.aws_ecs_service.monitoring[0]: Refreshing state... [id=arn:aws:ecs:eu-west-1:718307299417:service/dev-portfolio-cluster/dev-portfolio-monitoring]%0Amodule.ecs.aws_ecs_service.services["game-service"]: Refreshing state... [id=arn:aws:ecs:eu-west-1:718307299417:service/dev-portfolio-cluster/dev-portfolio-game-service]%0Amodule.ecs.aws_ecs_service.services["frontend-service"]: Refreshing state... [id=arn:aws:ecs:eu-west-1:718307299417:service/dev-portfolio-cluster/dev-portfolio-frontend-service]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # null_resource.build_and_push_images must be replaced%0A-/+ resource "null_resource" "build_and_push_images" {%0A      ~ id       = "3849459137950386280" -> (known after apply)%0A      ~ triggers = { # forces replacement%0A          ~ "always_run" = "2025-12-17T20:27:59Z" -> (known after apply)%0A        }%0A    }%0A%0A  # module.ecs.data.aws_region.current will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_region" "current" {%0A      + description = (known after apply)%0A      + endpoint    = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A    }%0A%0A  # module.ecs.aws_ecs_service.monitoring[0] will be updated in-place%0A  ~ resource "aws_ecs_service" "monitoring" {%0A        id                                 = "arn:aws:ecs:eu-west-1:718307299417:service/dev-portfolio-cluster/dev-portfolio-monitoring"%0A        name                               = "dev-portfolio-monitoring"%0A        tags                               = {%0A            "Environment" = "dev"%0A            "Name"        = "dev-portfolio-monitoring"%0A        }%0A      ~ task_definition                    = "arn:aws:ecs:eu-west-1:718307299417:task-definition/dev-portfolio-monitoring:7" -> (known after apply)%0A        # (15 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_service.services["frontend-service"] will be updated in-place%0A  ~ resource "aws_ecs_service" "services" {%0A        id                                 = "arn:aws:ecs:eu-west-1:718307299417:service/dev-portfolio-cluster/dev-portfolio-frontend-service"%0A        name                               = "dev-portfolio-frontend-service"%0A        tags                               = {%0A            "Environment" = "dev"%0A            "Name"        = "dev-portfolio-frontend-service"%0A        }%0A      ~ task_definition                    = "arn:aws:ecs:eu-west-1:718307299417:task-definition/dev-portfolio-frontend-service:7" -> (known after apply)%0A        # (15 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_service.services["game-service"] will be updated in-place%0A  ~ resource "aws_ecs_service" "services" {%0A        id                                 = "arn:aws:ecs:eu-west-1:718307299417:service/dev-portfolio-cluster/dev-portfolio-game-service"%0A        name                               = "dev-portfolio-game-service"%0A        tags                               = {%0A            "Environment" = "dev"%0A            "Name"        = "dev-portfolio-game-service"%0A        }%0A      ~ task_definition                    = "arn:aws:ecs:eu-west-1:718307299417:task-definition/dev-portfolio-game-service:7" -> (known after apply)%0A        # (15 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.monitoring[0] must be replaced%0A-/+ resource "aws_ecs_task_definition" "monitoring" {%0A      ~ arn                      = "arn:aws:ecs:eu-west-1:718307299417:task-definition/dev-portfolio-monitoring:7" -> (known after apply)%0A      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:718307299417:task-definition/dev-portfolio-monitoring" -> (known after apply)%0A      ~ container_definitions    = jsonencode(%0A            [%0A              - {%0A                  - cpu              = 0%0A                  - environment      = [%0A                      - {%0A                          - name  = "GF_DATASOURCES_DEFAULT_URL"%0A                          - value = "http://localhost:9090"%0A                        },%0A                      - {%0A                          - name  = "GF_SECURITY_ADMIN_PASSWORD"%0A                          - value = "admin123"%0A                        },%0A                      - {%0A                          - name  = "GF_USERS_ALLOW_SIGN_UP"%0A                          - value = "false"%0A                        },%0A                    ]%0A                  - essential        = true%0A                  - healthCheck      = {%0A                      - command     = [%0A                          - "CMD-SHELL",%0A                          - "wget --quiet --tries=1 --spider http://localhost:3000/api/health || exit 1",%0A                        ]%0A                      - interval    = 30%0A                      - retries     = 3%0A                      - startPeriod = 60%0A                      - timeout     = 5%0A                    }%0A                  - image            = "grafana/grafana:10.0.0"%0A                  - logConfiguration = {%0A                      - logDriver = "awslogs"%0A                      - options   = {%0A                          - awslogs-group         = "/ecs/dev-portfolio-grafana"%0A                          - awslogs-region        = "eu-west-1"%0A                          - awslogs-stream-prefix = "ecs"%0A                        }%0A                    }%0A                  - mountPoints      = []%0A                  - name             = "grafana"%0A                  - portMappings     = [%0A                      - {%0A                          - containerPort = 3000%0A                          - hostPort      = 3000%0A                          - protocol      = "tcp"%0A                        },%0A                    ]%0A                  - systemControls   = []%0A                  - volumesFrom      = []%0A                },%0A              - {%0A                  - cpu              = 0%0A                  - environment      = []%0A                  - essential        = true%0A                  - healthCheck      = {%0A                      - command     = [%0A                          - "CMD-SHELL",%0A                          - "wget --quiet --tries=1 --spider http://localhost:9090/-/healthy || exit 1",%0A                        ]%0A                      - interval    = 30%0A                      - retries     = 3%0A                      - startPeriod = 60%0A                      - timeout     = 5%0A                    }%0A                  - image            = "prom/prometheus:v2.40.0"%0A                  - logConfiguration = {%0A                      - logDriver = "awslogs"%0A                      - options   = {%0A                          - awslogs-group         = "/ecs/dev-portfolio-prometheus"%0A                          - awslogs-region        = "eu-west-1"%0A                          - awslogs-stream-prefix = "ecs"%0A                        }%0A                    }%0A                  - mountPoints      = []%0A                  - name             = "prometheus"%0A                  - portMappings     = [%0A                      - {%0A                          - containerPort = 9090%0A                          - hostPort      = 9090%0A                          - protocol      = "tcp"%0A                        },%0A                    ]%0A                  - systemControls   = []%0A                  - volumesFrom      = []%0A                },%0A            ]%0A        ) -> (known after apply) # forces replacement%0A      ~ id                       = "dev-portfolio-monitoring" -> (known after apply)%0A      ~ revision                 = 7 -> (known after apply)%0A        tags                     = {%0A            "Environment" = "dev"%0A            "Name"        = "dev-portfolio-monitoring-task"%0A        }%0A        # (11 unchanged attributes hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.services["frontend-service"] must be replaced%0A-/+ resource "aws_ecs_task_definition" "services" {%0A      ~ arn                      = "arn:aws:ecs:eu-west-1:718307299417:task-definition/dev-portfolio-frontend-service:7" -> (known after apply)%0A      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:718307299417:task-definition/dev-portfolio-frontend-service" -> (known after apply)%0A      ~ container_definitions    = jsonencode(%0A            [%0A              - {%0A                  - cpu              = 0%0A                  - environment      = [%0A                      - {%0A                          - name  = "GAME_SERVICE_URL"%0A                          - value = "http://game-service.dev-portfolio.local:8081"%0A                        },%0A                      - {%0A                          - name  = "LOG_LEVEL"%0A                          - value = "info"%0A                        },%0A                      - {%0A                          - name  = "PORT"%0A                          - value = "8080"%0A                        },%0A                    ]%0A                  - essential        = true%0A                  - healthCheck      = {%0A                      - command     = [%0A                          - "CMD-SHELL",%0A                          - "wget --quiet --tries=1 --spider http://localhost:8080/health || exit 1",%0A                        ]%0A                      - interval    = 30%0A                      - retries     = 3%0A                      - startPeriod = 60%0A                      - timeout     = 5%0A                    }%0A                  - image            = "718307299417.dkr.ecr.eu-west-1.amazonaws.com/portfolio-frontend-service:latest"%0A                  - logConfiguration = {%0A                      - logDriver = "awslogs"%0A                      - options   = {%0A                          - awslogs-group         = "/ecs/dev-portfolio-frontend-service"%0A                          - awslogs-region        = "eu-west-1"%0A                          - awslogs-stream-prefix = "ecs"%0A                        }%0A                    }%0A                  - mountPoints      = []%0A                  - name             = "frontend-service"%0A                  - portMappings     = [%0A                      - {%0A                          - containerPort = 8080%0A                          - hostPort      = 8080%0A                          - protocol      = "tcp"%0A                        },%0A                    ]%0A                  - systemControls   = []%0A                  - volumesFrom      = []%0A                },%0A            ]%0A        ) -> (known after apply) # forces replacement%0A      ~ id                       = "dev-portfolio-frontend-service" -> (known after apply)%0A      ~ revision                 = 7 -> (known after apply)%0A        tags                     = {%0A            "Environment" = "dev"%0A            "Name"        = "dev-portfolio-frontend-service-task"%0A        }%0A        # (11 unchanged attributes hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.services["game-service"] must be replaced%0A-/+ resource "aws_ecs_task_definition" "services" {%0A      ~ arn                      = "arn:aws:ecs:eu-west-1:718307299417:task-definition/dev-portfolio-game-service:7" -> (known after apply)%0A      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:718307299417:task-definition/dev-portfolio-game-service" -> (known after apply)%0A      ~ container_definitions    = jsonencode(%0A            [%0A              - {%0A                  - cpu              = 0%0A                  - environment      = [%0A                      - {%0A                          - name  = "LOG_LEVEL"%0A                          - value = "info"%0A                        },%0A                      - {%0A                          - name  = "PORT"%0A                          - value = "8081"%0A                        },%0A                    ]%0A                  - essential        = true%0A                  - healthCheck      = {%0A                      - command     = [%0A                          - "CMD-SHELL",%0A                          - "wget --quiet --tries=1 --spider http://localhost:8081/health || exit 1",%0A                        ]%0A                      - interval    = 30%0A                      - retries     = 3%0A                      - startPeriod = 60%0A                      - timeout     = 5%0A                    }%0A                  - image            = "718307299417.dkr.ecr.eu-west-1.amazonaws.com/portfolio-game-service:latest"%0A                  - logConfiguration = {%0A                      - logDriver = "awslogs"%0A                      - options   = {%0A                          - awslogs-group         = "/ecs/dev-portfolio-game-service"%0A                          - awslogs-region        = "eu-west-1"%0A                          - awslogs-stream-prefix = "ecs"%0A                        }%0A                    }%0A                  - mountPoints      = []%0A                  - name             = "game-service"%0A                  - portMappings     = [%0A                      - {%0A                          - containerPort = 8081%0A                          - hostPort      = 8081%0A                          - protocol      = "tcp"%0A                        },%0A                    ]%0A                  - systemControls   = []%0A                  - volumesFrom      = []%0A                },%0A            ]%0A        ) -> (known after apply) # forces replacement%0A      ~ id                       = "dev-portfolio-game-service" -> (known after apply)%0A      ~ revision                 = 7 -> (known after apply)%0A        tags                     = {%0A            "Environment" = "dev"%0A            "Name"        = "dev-portfolio-game-service-task"%0A        }%0A        # (11 unchanged attributes hidden)%0A    }%0A%0APlan: 4 to add, 3 to change, 4 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 2
```
</details>

### 🚀 Next Steps
- ℹ️ No infrastructure changes detected
- Monitor deployment in GitHub Actions after merge

---
*🐘 Generated by Elephant TF CI Bot*